class Urls:
    MAIN = ("https://qa-scooter.praktikum-services.ru/")  # главная яндекс самокат
    WHO_ORDER_URL = ("https://qa-scooter.praktikum-services.ru/order") # для кого самокат
    YANDEX = ("https://dzen.ru/?yredirect=true")  # главная страница Яндекса

class Texts:
    TEXT_COST = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    TEXT_SEVERAL_SCOOTERS = 'Пока что у нас так: один заказ — один самокат. ' \
                            'Если хотите покататься с друзьями, можете просто сделать несколько заказов — ' \
                            'один за другим.'
    TEXT_TIME_COST = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. ' \
                     'Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. ' \
                     'Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    TEXT_ORDER_TODAY = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    TEXT_CHANGE_ORDER = 'Пока что нет! Но если что-то срочное — ' \
                        'всегда можно позвонить в поддержку по красивому номеру 1010.'
    TEXT_CHARGER = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — ' \
                   'даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    TEXT_CANCEL_ORDER = 'Да, пока самокат не привезли. ' \
                        'Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    TEXT_MKAD = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

class TestValues:
    FIRST_NAME = "Жан Жак"
    SURNAME = "Тестировалль"
    ADRESS = "Вымышленный адрес"
    METRO = "Аэропорт"
    PHONE = "+79999999999"
    DATE_ORDER = "28.06.2023"
    COMMENTS = "Комментарий для курьера"

    FIRST_NAME_2 = "Агент"
    SURNAME_2 = "Смит"
    ADRESS_2 = "г. Зеон, ул. Машинная, д.5, корп.7"
    METRO_2 = "Автозаводская"
    PHONE_2 = "+77776665544"
    DATE_ORDER_2 = "01.07.2023"
    COMMENTS_2 = "Пожалуйста, не звоните утром, вы можете разбудить Нео"
